
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 7 to add, 1 to change, 7 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.POSTGRES_HOST[0]
* Replace
  * module.idam-testing-support-api-db-v14[0].azurerm_postgresql_flexible_server.pgsql_server
  * module.idam-testing-support-api-db-v14[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.idam-testing-support-api-db-v14[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.idam-testing-support-api-db-v14[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.idam-testing-support-api-db-v14[0].azurerm_postgresql_flexible_server_database.pg_databases[&#34;idamtstsptapi&#34;]
  * module.idam-testing-support-api-db-v14[0].azurerm_resource_group.rg[0]
  * module.idam-testing-support-api-db-v14[0].null_resource.set-user-permissions-additionaldbs[&#34;idamtstsptapi&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES_HOST[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
        id                      = "https://idam-idam-aat.vault.azure.net/secrets/idam-testing-support-api-POSTGRES-HOST/8efa4645c8dc4b5b84eb5c00904b4bfb"
        name                    = "idam-testing-support-api-POSTGRES-HOST"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.idam-testing-support-api-db-v14[0].azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      ~ fqdn                          = "idam-idam-aat-v14-testing-support-api-idam-aat.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/idam-idam-aat-v14-testing-support-api-data-idam-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/idam-idam-aat-v14-testing-support-api-idam-aat" -> (known after apply)
      ~ name                          = "idam-idam-aat-v14-testing-support-api-idam-aat" -> "idam-testing-support-api-v14-idam-aat" # forces replacement
      ~ public_network_access_enabled = false -> (known after apply)
      ~ resource_group_name           = "idam-idam-aat-v14-testing-support-api-data-idam-aat" -> "idam-testing-support-api-v14-data-idam-aat" # forces replacement
        tags                          = {
            "application"         = "cft-idam"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/idam-testing-support-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#idam-support-cft"
            "environment"         = "staging"
            "managedBy"           = "IdAM"
        }
      - zone                          = "2" -> null
        # (12 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.idam-testing-support-api-db-v14[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin must be replaced
-/+ resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      ~ id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/idam-idam-aat-v14-testing-support-api-data-idam-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/idam-idam-aat-v14-testing-support-api-idam-aat/administrators/e7ea2042-4ced-45dd-8ae3-e051c6551789" -> (known after apply)
      ~ resource_group_name = "idam-idam-aat-v14-testing-support-api-data-idam-aat" -> "idam-testing-support-api-v14-data-idam-aat" # forces replacement
      ~ server_name         = "idam-idam-aat-v14-testing-support-api-idam-aat" -> "idam-testing-support-api-v14-idam-aat" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.idam-testing-support-api-db-v14[0].azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      ~ id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/idam-idam-aat-v14-testing-support-api-data-idam-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/idam-idam-aat-v14-testing-support-api-idam-aat/administrators/ca6d5085-485a-417d-8480-c3cefa29df31" -> (known after apply)
      ~ resource_group_name = "idam-idam-aat-v14-testing-support-api-data-idam-aat" -> "idam-testing-support-api-v14-data-idam-aat" # forces replacement
      ~ server_name         = "idam-idam-aat-v14-testing-support-api-idam-aat" -> "idam-testing-support-api-v14-idam-aat" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.idam-testing-support-api-db-v14[0].azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/idam-idam-aat-v14-testing-support-api-data-idam-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/idam-idam-aat-v14-testing-support-api-idam-aat/configurations/backslash_quote" -> (known after apply)
        name      = "backslash_quote"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/idam-idam-aat-v14-testing-support-api-data-idam-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/idam-idam-aat-v14-testing-support-api-idam-aat" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.idam-testing-support-api-db-v14[0].azurerm_postgresql_flexible_server_database.pg_databases["idamtstsptapi"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/idam-idam-aat-v14-testing-support-api-data-idam-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/idam-idam-aat-v14-testing-support-api-idam-aat/databases/idamtstsptapi" -> (known after apply)
        name      = "idamtstsptapi"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/idam-idam-aat-v14-testing-support-api-data-idam-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/idam-idam-aat-v14-testing-support-api-idam-aat" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.idam-testing-support-api-db-v14[0].azurerm_resource_group.rg[0] must be replaced
-/+ resource "azurerm_resource_group" "rg" {
      ~ id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/idam-idam-aat-v14-testing-support-api-data-idam-aat" -> (known after apply)
      ~ name     = "idam-idam-aat-v14-testing-support-api-data-idam-aat" -> "idam-testing-support-api-v14-data-idam-aat" # forces replacement
        tags     = {
            "application"         = "cft-idam"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/idam-testing-support-api.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#idam-support-cft"
            "environment"         = "staging"
            "managedBy"           = "IdAM"
        }
        # (1 unchanged attribute hidden)
    }

  # module.idam-testing-support-api-db-v14[0].null_resource.set-user-permissions-additionaldbs["idamtstsptapi"] must be replaced
-/+ resource "null_resource" "set-user-permissions-additionaldbs" {
      ~ id       = "6143313687849402304" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "name"           = "idam-idam-aat-v14-testing-support-api" -> "idam-testing-support-api-v14"
            # (2 unchanged elements hidden)
        }
    }

Plan: 7 to add, 1 to change, 7 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":369,"Program":"tfcmt","SHA1":"","Vars":{}} -->